app/controllers/forms_controller.rb

SELECT "forms".* FROM "forms"
---
	def index
		@forms = Form.all

SELECT  "forms".* FROM "forms" WHERE "forms"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
	  @form = Form.find(params["id"])

INSERT INTO "forms" ("date", "wins", "repass", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2015-06-11"], ["wins", "making this"], ["repass", "making this pretty"], ["created_at", "2015-11-06 16:08:44.406946"], ["updated_at", "2015-11-06 16:08:44.406946"]]
---
def create
	form_params = params["form"].permit("name", "wins", "repass", "emoji")
  @form = Form.create(form_params)